tsung/sql_optimization_to_question_index.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="after-sql-question-index.pgqcuypmi2.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="280" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="283" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="285" unit="second"></users>
    </arrivalphase>

    <!-- 

    <arrivalphase phase="4" duration="20" unit="second">
      <users arrivalrate="70" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="8" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>

    <!-- Loadtest for writer -->
    <session name="writer" probability="100" type="ts_http">
      <request>
        <http url="/questions" method="GET" version="1.1"/>
      </request>

   </session>
  </sessions>
</tsung>